import random 
from collections import Counter 
def next_word_freq(array, sentence): 
	sen_len, word_list = len(sentence.split()), [] 
	for i in range(len(array)): 
		if ' '.join(array[i : i + sen_len]).lower() == sentence.lower(): 
			if i + sen_len < len(array) - 1: 
				word_list.append(array[i + sen_len]) 
	return dict(Counter(word_list)) 
def CDF(d): 
	prob_sum, sum_vals = 0, sum(d.values()) 
	for k, v in d.items(): 
		pmf = v / sum_vals 
		prob_sum += pmf 
		d[k] = prob_sum 
	return d 
def main(sent, x, n): 
	# corpus = open('a.txt','r').read() text fileaas unshih bolomjtoi

	corpus = '''Эрт урьд цагт араатны хаан Хангарьд газар дээр ямар амьтны мах хамгийн амттайг мэдэх гэж хараацай, хэдгэнэ хоёрыг дуудуудлж гэнэ. Дуудуулж ирүүлээд хэлэв. “Та хоёр энэ дэлхийг эргэн тойрон нисээд ямар амьтны мах илүү сайхан амттайг мэдэж ир” гэжээ. Хараацай хэдгэнэ хоёр зарлиг ёсоор нисэн оджээ. Тэр өдрийн тэнгэр цэлмэг, нар дуртмал, найртай дулаан байсан тул хараацай шувуу хаан эзнийхээ зарлигийг мартаад хөх тэнгэрт хөөрн нисч, хөгжилтэй сайхан жиргэн дуулж дуртмал наранд ээж, дураа ханатал
цэнгэж явав. Хорт муу санаат хэдгэнэ л харин харгуй замд дайралдсан хамаг амьтныг хатгаж,халуун цусыг нь амталж явав. Тэгж байтал нар шингэж тэр хоёр ч буцах болов. Тэмдэгт газраа хоёулаа уулзаад буцах замдаа хараацай шувуу хэдгэнээс асуув.
- Ямар амьтны мах хамгаас амттай гэж мэдэв чи ? гэсэнд хэдгэнэ:
- Хүний мах л хамгийн амттай юм гэж гэж мэдлээ. Хүндэт хаан маань одоо хүний махаар л
хооллох болно гэв. Хараацай шувуу харамсан гашуудаж, хөөрхий хүн төрөлхтөнг хөнөөлөөс
яаж аврах билээ? гэж гайхаш нь барагдаад “Амьд хүний цусыг яаж үзээ вэ?” гэсэнд хэдгэнэ:
- Аа, тэр юухан байхав .Хатгуураа хатгаад л хэлээрээ амталж үзлээ гэсэнд хараацай:
- Тэр сүрхий амталдаг хэл чинь аль вэ? гэсэнд хэдгэнэ
- Энэ гэж амаа ангайн хэлээ үзүүлсэнд хараацай хэлийг нь суга татчихжээ. Тэр цагаас хойш хэдгэнэ урьдын адил донгодож чадахаа байгаад зүгээр л дүнгэнэдэг
болчихсон гэнэ. Тэгээд шувууны хаанд очиж хэдгэнэ хойно урд нь бөртөгнөн гомдол зарга
мэдүүлэн, байдаг чадлаараа дүнгэнэсэн боловч нэгэнт хэлгүй болсон болохоор юу ч хэлж
чадсангүй. Юу гэж дүнгэнээд байгаа юм бэ? Юу ч ойлгохгүй байна гэж шувууны хаан унтууцан
хилэгнэж
- Хараацай чи хэл. Хэний мах илүү амттай вэ ? гэсэнд “Хамгийн амттай нь могойн мах” гэжээ.
Шувууны хаан хараацай үгийг үнэмшээд могой барьж иддэг болов гэнэ.
Одоо ханьгардын удмаас ганц элээ үлдэж хоцорсон бөгөөд хааныхаа нэг адил могой идэх дуртай болсон нь тэр гэнэ.
'''
	l = corpus.split() 
	temp_out = '' 
	out = sent + ' '
	for i in range(n - x): 
		func_out = next_word_freq(l, sent) 
		cdf_dict = CDF(func_out) 
		rand = random.uniform(0, 1) 
		try: key, val = zip(*cdf_dict.items()) 
		except: break
		for j in range(len(val)): 			
			if rand <= val[j]: 
				pos = j 
				break				
		temp_out = key[pos] 
		out = out + temp_out + ' '
		sent = temp_out 
		
	print(out, end = '\n\n') 

if __name__ == '__main__': 

	inp_sent = input("ugee oruulna uu :")
	# garaltiin ugiin too 10. 
	main(inp_sent, len(inp_sent), 10) 
